### 桥梁模式
#### 所以桥梁模式的用意是“将抽象化与实现化脱耦，使得二者可以独立地变化。”
包括以下四部分：
1. 角色：抽象化给出的定义，并保存一个对实现化对象的引用，就是图像类中的形状父类。
2. 象化角色：扩展抽象化角色，改变和修正父类对抽象化的定义，比如形状下有正方形，圆形等图形。
3. 角色：这个角色给出具体角色的接口，但是不给出具体的实现，这个接口不一定和抽象化角色的接口定义相同，实际上两者可以完全不一样，好比形状的颜色接口。
4. 现化角色：这个角色给出实现化角色接口的具体实现，好比各种具体的颜色。

个人理解：
1. 一个抽象接口；
2. 一个抽象类，类中有个属性是1中口的实现类，有一个更改器或者构造方法可以动态装配接口的实现类；
3. 接口的具体实现类；
4. 扩展的抽象类；

参考：
[菜鸟教程-桥接模式](http://www.runoob.com/design-pattern/bridge-pattern.html)
[csdn博客](https://blog.csdn.net/xingjiarong/article/details/50132727)

